# 基本工作原理
# HTTP是浏览器或者其他客户端（如手机app）与网站服务器之间沟通的协议
# 浏览器作为客户端通过URL向Http服务端即Web服务器发送所有请求
# Web服务器接收到请求后，向客户端发送响应信息

# HTTP的三个要点
# 1.http是无连接：无连接的含义是限制每次连接只处理一个请求，当服务器端接收到客户端的请求并且响应了请求之后就断开连接了
#   采用这种方式可以节省传输时间
# 2.http是媒体独立的：这就意味着只要是客户端和服务器端知道如何处理的数据内容，任何类型的数据都可以通过http发送
# 3.http是无状态的:http协议是无状态协议，代表着它对事务的处理没有记忆能力，也就是如果要处理前面已经处理过的事务就必须重新重新传
#   但是同时也代表服务器不需要处理先前的信息，所有它应答就会比较快

# 主要流程和概念
# 请求
#   1.地址和关键词：例如：GET https://www.naidu.com
#   2.*请求头（header）*：用来描述请求和发送者的一些信息
#   3.*请求参数*：以百度为例，要搜索的关键词
# 响应
#   1.*响应代码*：200表示成功，404表示不存在
#   2.*响应头（header）*：描述响应内容的一些信息
#   3.响应内容：HTML、JSON、图片等

# 完整的网页请求过程
# 注意你看到的一个网页一般是分多次请求的，一般过程为：
#   1.先请求网页文本，也就是HTML
#   2.根据HTML中的指定地址请求其他内容，最常见的是样式表，javaScript，图片等
#   3.每一行都是一个请求

# 请求行
# 下面例子中的第一行就是请求行，它包含几个关键信息：
# 1.请求方法：例子中的GET，表示你要干什么
# 2.请求的资源地址：例子中是/hello.txt，结合下面的HOST就可以拼出完整的地址
# 3.使用的HTTP协议版本号
# http协议有多个版本，现在主要用1.1，HTTP2也有一些应用

# GET /hello.txt HTTP/1.1
# user-agent: curl/7.16.3 libcurl/7.16.3 OpenSSL/0.9.7l zlib/1.2.3
# Host: www.example.com
# Accept-Language : en,mi

# 请求方法
# 根据HTTP标准，HTTP协议可以使用多种请求方法，这些方法表示这个请求要做什么
# 最常用的请求方法是：
#   GET请求表示要获取内容，它不会修改服务器上的数据
#   POST请求表示要提交的内容，通常会修改服务器上的内容
#   PUT请求表示从客户端向服务器传送的数据取代指定的文档的内容
#   DELETE请求表示请求服务器删除指定的页面

# 请求参数
# GET请求的请求参数
# get请求的参数都是放在URL中的，网页上能看到
# 请求参数是按键值对的形式出现的，一般形式为：
#   网址的后面紧跟的是一个问号
#   问号的后面是一对对参数，形式为：参数1 = 参数1的值
#   多个参数之间用&隔开
# POST请求的请求参数
#   post请求的请求参数再请求体中
#   网页上看不到
#   但可以通过chrome开发者工具或者抓包工具看见

# *请求头*
# 服务器通常通过请求头来：
# 1.判断请求是否合法，这是最基本的反爬措施
# 2.判断用户是否登录了，一般通过Cookie这个特殊的请求头的内容来判定，只要我们给出合理的Cookie，服务器就认为我们是登录过了
# 最重要的几个请求头：
# User-Agent:代表发起访问的是什么浏览器，如果不写，基本就会被判定为爬虫，就被拒绝了
# Cookie:里面记录了登录信息，或者上次请求服务器设置的信息，也是常用的反爬判定点
# Referer:表示这次请求是从哪里过来的，有的网页不允许你直接访问某个网页，必须从其他的网页过来，这时候就需要设置一个referer值

# 状态码
# 常见的状态码
#   200：请求成功
#   301：资源（网页等）被永久转移到其他URL（也就是被转移到了新的网址）
#   404：请求的资源（网页等）不存在
#   500：内部服务器错误

# 响应头
# HTTP响应头包含网页的重要描述信息，比如网页的格式，网页的过期时间等等
# 此外响应头里面还有一个比较重要的Set_Cookie:这个东西是用来做身份识别的

# 响应内容和content type 
# 我们最常见的网页的内容格式为：
#   HTML：给人看的页面
#   JSON：数据格式，一般是API，给程序用的，一般是手机app
#   XML：也是数据格式
# 除此之外还有样式表，图片，JavaScripe等
# 响应头里面的content_type就告诉了我们返回的内容的格式是什么